[
    {
        "StartDate": "August 29th, 2022",
        "Progress": [
            "Setup initial team website repository & workflow for deploying changes to live site",
            "Signed & collected open source agreements",
            "Organized & attended our team social event"
        ],
        "Risks": ["Challenge of working across two separate teams: one being our Rochester-based project team and the Hawaii-based team"],
        "Plans": [
            "Each member walkthrough TestSmells repository/code, get program running locally",
            "Begin development of our initial domain model"
        ],
        "Needs": ["Clarification on working structure with Hawaii students"]
    },
    {
        "StartDate": "September 5th, 2022",
        "Progress": [
            "Added weekly update page to website with ability to add, modify, and delete 4-Ups at any point in time",
            "Continued development of initial domain model",
            "Created project synopsis draft to be reviewed with the sponsors"],
        "Risks": [
            "None that affect the current plans we have for both this week and the next"
        ],
        "Plans": [
            "Finalize domain model and development methodology",
            "Gain approval on project synopsis & update website with this description",
            "Determine metrics for the project",
            "Finalize relevant search keywords for project: Test-smell, Test(ing), Plugin, Java, Analysis"
        ],
        "Needs": [
            "Pending sponsor/coach feedback, hosting platform for possible database solution & dashboard",
            "Code walkthrough video"
        ]
    },
    {
        "StartDate": "September 12th, 2022",
        "Progress": [
            "Transferred website to github organization used for TSDetect development",
            "Development methodology & process draft produced and discussed in detail",
            "Code walkthrough review and extensive research into the codebase",
            "Initial domain model design finalized for submission",
            "Initial breakdown of tasks for each feature"
        ],
        "Risks": [
            "Minor risk: need to ensure we communicate with the Hawaii-based team to ensure we establish the format for results that we will be using for results tracking"
        ],
        "Plans": [
            "Using our gathered requirements, begin breaking down the epics/stories we have in the github kanban board currently into tasks that can be completed in various sprints. This also includes setting up a high-level timeline for different sprints",
            "The above goes hand-in-hand with our ‘finalized project plan’ which we will be discussing going forward, specifically that of: Will we need a new method of managing risks aside from 4-ups?"
        ],
        "Needs": [
            "Sponsor approval on the final initial project plan"
        ]
    },
    {
        "StartDate": "September 19th, 2022",
        "Progress": [
            "Initial breakdown of stories with associated story point values",
            "Begin brief look into topics tied to our spike stories, specifically headless mode"
        ],
        "Risks": [
            "Potential minor risk: inaccurate point estimation for current stories",
            "Some stories have questions tied to them that can radically change their story point value",
            "Midterms are beginning, so members will have less availability than usual"
        ],
        "Plans": [
            "Continue breaking down requirements",
            "Complete headless mode spike",
            "Begin midterm assessment review"
        ],
        "Needs": [
            "Determination on if we are collecting some identifying information in the centralized database"
        ]
    },
    {
        "StartDate": "September 26th, 2022",
        "Progress": [
            "Pivoted to database schema spike and conducted research",
            "Decided on 3 primary choices for the database"
        ],
        "Risks": [
            "None"
        ],
        "Plans": [
            "Begin filling out midterm evaluation document "
        ],
        "Needs": [
            "Schedule the midterm retrospective meeting (~40 minutes during a sponsor meeting)"
        ]
    },
    {
        "StartDate": "October 3rd, 2022",
        "Progress": [
            "Added user stories to Kanban board",
            "Assigned user stories and defined requirements for stories in Sprint 1",
            "Database ER diagram & schema defined",
            "MySQL database and phpMyAdmin setup with Docker containers: One command to create and run both containers",
            "SQL script to populate db with random data for testing purposes",
            "Began investigations into modes of communication with the database",
            "Made progress on midterm review","Began drafting landing page for the dashboard",
            "Wrote first draft of API specification document"
        ],
        "Risks": [
            "Centralized data piping story poorly defined, needs breakdown and redefinition"
        ],
        "Plans": [
            "Continue progressing on existing stories",
            "Solidify communication methods with the server",
            "First draft of database webpage"
        ],
        "Needs": [
            "None at this moment"
        ]
    },
    {
        "StartDate": "October 10th, 2022",
        "Progress": [
            "Defined database schema",
            "Finalized midterm review document",
            "PR up for landing view of the dashboard"
        ],
        "Risks": [
            "Lack of documented requirements in organized fashion"
        ],
        "Plans": [
            "Discuss data communication story and breakdown into smaller stories.",
            "Discuss midterm review document with sponsor and coaches.",
            "Sprint retrospective"
        ],
        "Needs": [
            "Midterm review document"
        ]
    },
    {
        "StartDate": "October 17th, 2022",
        "Progress": [
            "Added users with permissions to the database for the plugin and dashboard",
            "Research into headless mode",
            "Progress on Server-side database interaction tools",
            "Proposed solution for configuration of popup (storing of opt-in permission)",
            "Initial breakdown of data piping story (unfinished)",
            "Sprint retrospective",
            "Created project timeline"
        ],
        "Risks": [
            "Lack of documented requirements in organized fashion"
        ],
        "Plans": [
            "Discuss data communication story and breakdown into smaller stories.",
            "Discuss midterm review document with sponsor and coaches.",
            "Sprint retrospective"
        ],
        "Needs": [
            "Midterm review document"
        ]
    },
    {
        "StartDate": "October 24th, 2022",
        "Progress": [
            "Headless mode works for single and multiple projects: ApplicationStarter class created and set as appStarter extension in plugin.xml\nAnalyzes projects passed in as arguments, Prints the results to the console similar to how they are displayed in the UI",
            "Requirements clarification",
            "Sprint two planning"
        ],
        "Risks": [
            "Midterms round two this week"
        ],
        "Plans": [
            "Create custom gradle task for headless mode",
            "Assign stories for sprint two in sprint planning",
            "Begin setup of server application"
        ],
        "Needs": [
            "None"
        ]
    },
    {
        "StartDate": "October 31st, 2022",
        "Progress": [
            "Finished PRs left over from Sprint 1",
            "Got popup into review",
            "Began Sprint 2 server application running with functioning example endpoint",
            "Headless mode scripts functional"
        ],
        "Risks": [
            "None"
        ],
        "Plans": [
            "Finish server application configuration",
            "Finish opt-in popup functionality",
            "Finish headless mode script and custom gradle task",
            "Begin developing our <1 minute video demonstrating project"
        ],
        "Needs": [
            "None"
        ]
    },
    {
        "StartDate": "November 7th, 2022",
        "Progress": [
            "Initial server application running",
            "Thoroughly reviewed and merged in PRs from sprint one ",
            "Popup/checkbox in testing stages ",
            "Report CSV functional for headless and regular running",
            "Plugin data converted to JSON wrapped HashMap"
        ],
        "Risks": [
            "None"
        ],
        "Plans": [
            "Record video",
            "Continue sprint 2 stories",
            "Begin end of semester presentation"
        ],
        "Needs": [
            "None"
        ]
    },
    {
        "StartDate": "January 26th, 2023",
        "Progress": [
            "Completed unit testing of API repository layer classes.",
            "Developed solution for networking between docker containers (database and server application). Still need to resolve an issue with datasource setup on the server application side of things.",
            "User instructions for running the tool created."
        ],
        "Risks": [
            "General schedule concerns",
            "Usability testing scope",
            "Team illness",
            "TSDetect tool bug rendering it inoperable in various runs"
        ],
        "Plans": [
            "Refamiliarize ourselves with environment, begin working on final set of features for MVP.",
            "Begin fleshing out script for usability testing later in semester.",
            "Begin drafting technical report document for EOS.",
            "Finish up Pull Requests for completed stories."
        ],
        "Needs": [
            "Determine where the server is going to live.",
            "Field interest for usability testing users."
        ]
    },
    {
        "StartDate": "February 2nd, 2023",
        "Progress": [
            "Causes of incorrect report generation behavior has been identified",
            "Merged the opt in popup to main",
            "Completed testing of the API service layer"
        ],
        "Risks": [
            "Headless integration into CI workflow possibly out of scope"
        ],
        "Plans": [
            "Continue working on user stories",
            "Identifying a means for generating a UUID",
            "Ensure there is no further propagation of aforementioned report bug",
            "Start TRD"
        ],
        "Needs": [
            "Begin generating content/questions for usability testing"
        ]
    },
    {
        "StartDate": "February 9th, 2023",
        "Progress": [
            "Merged server application into main",
            "Successfully made request between spring boot container and dashboard ",
            "Dashboard time filtering set-up with test connection to database"
        ],
        "Risks": [
            "None"
        ],
        "Plans": [
            "Continue fleshing out usability testing survey/ instructions",
            "Continue fleshing out TRD",
            "Continue working on user stories"
        ],
        "Needs": [
            "Collaborative usability testing instructions?"
        ]
    },
    {
        "StartDate": "February 16th, 2023",
        "Progress": [
            "Plugin API moved to testing",
            "Dashboard API moved to testing",
            "Augmented usability testing instructions/survey"
        ],
        "Risks": [
            "None"
        ],
        "Plans": [
            "Finish unit testing for the repository layer tools",
            "Begin adding tests for plugin/dashboard APIs"
        ],
        "Needs": [
            "Collaborative usability testing instructions?"
        ]
    },
    {
        "StartDate": "February 23rd, 2023",
        "Progress": [
            "Usability test help email has been created",
            "Completed testing of the repository layer classes",
            "Completed initial testing of dashboard API endpoint controller & service functionality"
        ],
        "Risks": [
            "Midterms in coming weeks"
        ],
        "Plans": [
            "UUID, dashboard changes",
            "Continued testing efforts of APIs and data writing"
            
        ],
        "Needs": [
            "Schedule midterm retrospective document review",
            "Usability testing assignment details (if still needed)",
            "Grad lab computer for hosting during the testing"
        ]
    }
]
